### Create Table

In [4]:
import sqlite3
conn = sqlite3.connect('data/sqlite/db')
conn.execute("CREATE TABLE user (fname VARCHAR(255), department VARCHAR(255), password VARCHAR(50))")
conn.commit()

### Insert Data

In [5]:
data = [
    ('Dev Khadka', 'Office', 'JPT'),
    ('Roshu Karki', 'Pasal', 'ABC'),
    ('Hridayan Khadka', 'School', '223' )
]

insert_query = "INSERT INTO user (fname, department, password) VALUES (?,?,?)"
conn.executemany(insert_query, data)
conn.commit()

### Select Data

In [17]:

cursor = conn.execute("select * from user")
rows = cursor.fetchall()
display(rows)
display(cursor.description)

[('Dev Khadka', 'Office', 'JPT'),
 ('Roshu Karki', 'Pasal', 'ABC'),
 ('Hridayan Khadka', 'School', '223')]

(('fname', None, None, None, None, None, None),
 ('department', None, None, None, None, None, None),
 ('password', None, None, None, None, None, None))

### Load to DataFrame

In [21]:
import pandas as pd
df = pd.DataFrame(rows, columns=[col[0] for col in cursor.description])
df

             fname department password
0       Dev Khadka     Office      JPT
1      Roshu Karki      Pasal      ABC
2  Hridayan Khadka     School      223

### Loding Directly to DataFrame

In [26]:
import sqlalchemy as sqla
db = sqla.create_engine("sqlite:///data/sqlite/db")
pd.read_sql('select * from user', db)

             fname department password
0       Dev Khadka     Office      JPT
1      Roshu Karki      Pasal      ABC
2  Hridayan Khadka     School      223